<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"e5bdb8c92153e08c6a4de4aa091ae88127614586635679d1246cc3ad9f3408ac","plan_job_ref":"Job Test plan target and replace #379 at https://github.com/dflook/terraform-github-actions/actions/runs/7182456212","plan_hash":"ec5fb900543a1ecbe661887fe5f1fd635a3405fdfe1c3807c2004dd7ca9f1784","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "u04PwxGSxt" -> (known after apply)
  ~ foreach = "q3HYLqhiMb" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #379](https://github.com/dflook/terraform-github-actions/actions/runs/7182456212)